{
  "1": 0,
  "?a": 1,
  "?ɑ": 2,
  "a": 3,
  "a.": 4,
  "a.ː": 5,
  "a2": 6,
  "a4": 7,
  "a5": 8,
  "a6": 9,
  "a`": 10,
  "aa": 11,
  "ai": 12,
  "ai2": 13,
  "ai5": 14,
  "aiɜ": 15,
  "aiː": 16,
  "au": 17,
  "aɜ": 18,
  "aɨ": 19,
  "aɪ": 20,
  "aɪə": 21,
  "aɪɚ": 22,
  "aɪʲ": 23,
  "aɪ̃": 24,
  "aʊ": 25,
  "aʊ̃": 26,
  "aʲ": 27,
  "aː": 28,
  "aː2": 29,
  "aː4": 30,
  "aː5": 31,
  "aː6": 32,
  "aːɜ": 33,
  "aːʰχ": 34,
  "aːː": 35,
  "ã": 36,
  "ãː": 37,
  "b": 38,
  "bʰ": 39,
  "bʰː": 40,
  "bʲ": 41,
  "bʲʲ": 42,
  "bː": 43,
  "c": 44,
  "cʰ": 45,
  "cʰcʰ": 46,
  "cː": 47,
  "d": 48,
  "d^": 49,
  "dz": 50,
  "dzː": 51,
  "dʑ": 52,
  "dʑʲ": 53,
  "dʒ": 54,
  "dʒʲ": 55,
  "dʒː": 56,
  "dʰ": 57,
  "dʰː": 58,
  "dʲ": 59,
  "dʲʲ": 60,
  "dː": 61,
  "dˤ": 62,
  "dˤdˤ": 63,
  "d̪": 64,
  "d͡z": 65,
  "d͡zʲ": 66,
  "e": 67,
  "e1": 68,
  "e2": 69,
  "e4": 70,
  "e5": 71,
  "e6": 72,
  "e7": 73,
  "ea": 74,
  "ee": 75,
  "ei": 76,
  "eiː": 77,
  "eo": 78,
  "eu": 79,
  "ey": 80,
  "eɑ": 81,
  "eə": 82,
  "eɜ": 83,
  "eɪ": 84,
  "eɪʲ": 85,
  "eʊ": 86,
  "eː": 87,
  "eː2": 88,
  "eːɜ": 89,
  "eːː": 90,
  "ẽ": 91,
  "ẽː": 92,
  "e̞": 93,
  "e̞e̞": 94,
  "f": 95,
  "fʲ": 96,
  "fʲʲ": 97,
  "h": 98,
  "hh": 99,
  "hʲ": 100,
  "i": 101,
  "i.": 102,
  "i.ː": 103,
  "i2": 104,
  "i4": 105,
  "i5": 106,
  "i6": 107,
  "ie": 108,
  "ieː": 109,
  "iu": 110,
  "iy": 111,
  "iə": 112,
  "iə2": 113,
  "iə4": 114,
  "iə5": 115,
  "iə6": 116,
  "iəɜ": 117,
  "iɛ": 118,
  "iɛ2": 119,
  "iɛ4": 120,
  "iɛ5": 121,
  "iɛ6": 122,
  "iɛɜ": 123,
  "iɜ": 124,
  "iɪ": 125,
  "iʊ": 126,
  "iʲ": 127,
  "iː": 128,
  "iː5": 129,
  "iːʲ": 130,
  "iːː": 131,
  "iːːʲ": 132,
  "ĩ": 133,
  "ĩː": 134,
  "j": 135,
  "ja": 136,
  "ju": 137,
  "k": 138,
  "k^": 139,
  "kh": 140,
  "kʰ": 141,
  "kʰː": 142,
  "kʲ": 143,
  "kː": 144,
  "l": 145,
  "lʲ": 146,
  "lʲʲ": 147,
  "lː": 148,
  "l̩": 149,
  "l̩ː": 150,
  "m": 151,
  "mʲ": 152,
  "mʲʲ": 153,
  "mː": 154,
  "m̩": 155,
  "n": 156,
  "nʲ": 157,
  "nʲʲ": 158,
  "nː": 159,
  "n̩": 160,
  "o": 161,
  "o2": 162,
  "o4": 163,
  "o5": 164,
  "o6": 165,
  "o`": 166,
  "oi": 167,
  "oiː": 168,
  "ou": 169,
  "oɜ": 170,
  "oɪ": 171,
  "oʊ": 172,
  "oː": 173,
  "oːː": 174,
  "õ": 175,
  "õː": 176,
  "o̞": 177,
  "o̞o̞": 178,
  "p": 179,
  "pf": 180,
  "ph": 181,
  "pʰ": 182,
  "pʲ": 183,
  "pʲʲ": 184,
  "pː": 185,
  "q": 186,
  "qː": 187,
  "r": 188,
  "r.": 189,
  "rʲ": 190,
  "r̝": 191,
  "r̝̊": 192,
  "r̩": 193,
  "r̩ː": 194,
  "s": 195,
  "s^": 196,
  "ss": 197,
  "sʲ": 198,
  "s̪": 199,
  "s̪ː": 200,
  "t": 201,
  "t^": 202,
  "t^ː": 203,
  "ts": 204,
  "tsʰ": 205,
  "tsʲ": 206,
  "tsʲʲ": 207,
  "tsː": 208,
  "tɕ": 209,
  "tɕʲ": 210,
  "tʃ": 211,
  "tʃʰ": 212,
  "tʃʲ": 213,
  "tʃː": 214,
  "tʰ": 215,
  "tʰː": 216,
  "tʲ": 217,
  "tʲʲ": 218,
  "tː": 219,
  "t̪": 220,
  "t̪ː": 221,
  "t͡s": 222,
  "t͡st͡s": 223,
  "t͡st͡sʲ": 224,
  "t͡sʲ": 225,
  "t͡ʃ": 226,
  "u": 227,
  "u\"": 228,
  "u.": 229,
  "u.ː": 230,
  "u2": 231,
  "u4": 232,
  "u5": 233,
  "u6": 234,
  "ud": 235,
  "ui": 236,
  "uo": 237,
  "uə": 238,
  "uə2": 239,
  "uə4": 240,
  "uə5": 241,
  "uə6": 242,
  "uəɜ": 243,
  "uɜ": 244,
  "uɨ": 245,
  "uɪ": 246,
  "uː": 247,
  "uː2": 248,
  "uː5": 249,
  "uːɜ": 250,
  "ũ": 251,
  "ũː": 252,
  "v": 253,
  "vʲ": 254,
  "vʲʲ": 255,
  "w": 256,
  "wʲ": 257,
  "x": 258,
  "xʲ": 259,
  "y": 260,
  "y2": 261,
  "y4": 262,
  "y5": 263,
  "y6": 264,
  "yi": 265,
  "yø": 266,
  "yə": 267,
  "yə2": 268,
  "yə4": 269,
  "yə5": 270,
  "yə6": 271,
  "yəɜ": 272,
  "yɜ": 273,
  "yɪ": 274,
  "yʊ": 275,
  "yː": 276,
  "z": 277,
  "zʲ": 278,
  "zʲʲ": 279,
  "ä": 280,
  "ää": 281,
  "æ": 282,
  "æi": 283,
  "æiː": 284,
  "æy": 285,
  "æː": 286,
  "ç": 287,
  "ð": 288,
  "ø": 289,
  "øi": 290,
  "øy": 291,
  "øː": 292,
  "ħ": 293,
  "ĩ": 294,
  "ŋ": 295,
  "ŋː": 296,
  "ŋ̩": 297,
  "œ": 298,
  "œy": 299,
  "œː": 300,
  "œ̃": 301,
  "ũ": 302,
  "ɐ": 303,
  "ɐs": 304,
  "ɐtʃ": 305,
  "ɐɐ": 306,
  "ɐ̃": 307,
  "ɐ̃ʊ̃": 308,
  "ɐ̯": 309,
  "ɑ": 310,
  "ɑɑ": 311,
  "ɑɨ": 312,
  "ɑː": 313,
  "ɑːɹ": 314,
  "ɑ̃": 315,
  "ɒ": 316,
  "ɒɒ": 317,
  "ɔ": 318,
  "ɔ2": 319,
  "ɔ4": 320,
  "ɔ5": 321,
  "ɔ6": 322,
  "ɔa": 323,
  "ɔø": 324,
  "ɔɔ": 325,
  "ɔɜ": 326,
  "ɔɨ": 327,
  "ɔɪ": 328,
  "ɔɪʲ": 329,
  "ɔː": 330,
  "ɔːɹ": 331,
  "ɔ̃": 332,
  "ɕ": 333,
  "ɕʲ": 334,
  "ɖ": 335,
  "ɖɖ": 336,
  "ɖʰ": 337,
  "ɖʰɖʰ": 338,
  "ɖʲ": 339,
  "ɖ͡ʐ": 340,
  "ɗ": 341,
  "ə": 342,
  "ə1": 343,
  "ə2": 344,
  "ə4": 345,
  "ə5": 346,
  "ə6": 347,
  "əl": 348,
  "əɜ": 349,
  "əɨ": 350,
  "əɪ": 351,
  "əɪ2": 352,
  "əɪ4": 353,
  "əɪ5": 354,
  "əɪ6": 355,
  "əɪɜ": 356,
  "əʊ": 357,
  "əː": 358,
  "əː2": 359,
  "əː4": 360,
  "əː5": 361,
  "əː6": 362,
  "əːɜ": 363,
  "ɚ": 364,
  "ɛ": 365,
  "ɛ2": 366,
  "ɛ4": 367,
  "ɛ5": 368,
  "ɛ6": 369,
  "ɛɜ": 370,
  "ɛɪ": 371,
  "ɛɹ": 372,
  "ɛʊ": 373,
  "ɛʰχ": 374,
  "ɛː": 375,
  "ɛ̃": 376,
  "ɜ": 377,
  "ɜː": 378,
  "ɟ": 379,
  "ɟʰ": 380,
  "ɟː": 381,
  "ɡ": 382,
  "ɡʰ": 383,
  "ɡʰː": 384,
  "ɡʲ": 385,
  "ɡː": 386,
  "ɣ": 387,
  "ɣʲ": 388,
  "ɨ": 389,
  "ɨu": 390,
  "ɨː": 391,
  "ɪ": 392,
  "ɪ^": 393,
  "ɪu": 394,
  "ɪuː": 395,
  "ɪɹ": 396,
  "ɪʲ": 397,
  "ɪː": 398,
  "ɪːʲ": 399,
  "ɪ̃": 400,
  "ɫ": 401,
  "ɫh": 402,
  "ɫp": 403,
  "ɫs": 404,
  "ɫtɕ": 405,
  "ɬ": 406,
  "ɭ": 407,
  "ɭʲ": 408,
  "ɯ": 409,
  "ɯɯ": 410,
  "ɯᵝ": 411,
  "ɯᵝɯᵝ": 412,
  "ɲ": 413,
  "ɲʲ": 414,
  "ɳ": 415,
  "ɴ": 416,
  "ɵ": 417,
  "ɵː": 418,
  "ɸ": 419,
  "ɹ": 420,
  "ɻ": 421,
  "ɽ": 422,
  "ɽʲ": 423,
  "ɾ": 424,
  "ɾʲ": 425,
  "ɾʲʲ": 426,
  "ʀ": 427,
  "ʁ": 428,
  "ʂ": 429,
  "ʂʲ": 430,
  "ʃ": 431,
  "ʃʲ": 432,
  "ʃʲʲ": 433,
  "ʈ": 434,
  "ʈʈ": 435,
  "ʈʰ": 436,
  "ʈʰʈʰ": 437,
  "ʈ͡ʂ": 438,
  "ʈ͡ʂʈ͡ʂ": 439,
  "ʉ": 440,
  "ʉʲ": 441,
  "ʊ": 442,
  "ʊɐ": 443,
  "ʊə": 444,
  "ʊɹ": 445,
  "ʊʰχ": 446,
  "ʊː": 447,
  "ʋ": 448,
  "ʌ": 449,
  "ʌtɕ": 450,
  "ʌɐ": 451,
  "ʌʊ": 452,
  "ʌʰχ": 453,
  "ʌː": 454,
  "ʌ̃": 455,
  "ʎ": 456,
  "ʏ": 457,
  "ʐ": 458,
  "ʑ": 459,
  "ʒ": 460,
  "ʒʲ": 461,
  "ʔ": 462,
  "ʔe": 463,
  "ʔeː": 464,
  "ʔi": 465,
  "ʔo": 466,
  "ʔu": 467,
  "ʔy": 468,
  "ʔœ": 469,
  "ʔʌ": 470,
  "ʕ": 471,
  "ʕʕ": 472,
  "ʝ": 473,
  "ʰχ": 474,
  "ʲ": 475,
  "β": 476,
  "ε": 477,
  "θ": 478,
  "χ": 479,
  "ᵻ": 480,
  "[UNK]": 481,
  "[PAD]": 482
}