{
  "a": 0,
  "a1": 1,
  "a2": 2,
  "a4": 3,
  "a5": 4,
  "a6": 5,
  "a7": 6,
  "aa1": 7,
  "aa2": 8,
  "aa4": 9,
  "aa5": 10,
  "aa6": 11,
  "aa7": 12,
  "aai1": 13,
  "aai2": 14,
  "aai4": 15,
  "aai5": 16,
  "aai6": 17,
  "aaiɜ": 18,
  "aanɡ1": 19,
  "aanɡ2": 20,
  "aanɡ4": 21,
  "aanɡ5": 22,
  "aanɡ6": 23,
  "aanɡ7": 24,
  "aau1": 25,
  "aau2": 26,
  "aau4": 27,
  "aau5": 28,
  "aau6": 29,
  "aauɜ": 30,
  "aaɜ": 31,
  "ai1": 32,
  "ai2": 33,
  "ai4": 34,
  "ai5": 35,
  "ai6": 36,
  "aiɜ": 37,
  "anɡ1": 38,
  "anɡ2": 39,
  "anɡ4": 40,
  "anɡ6": 41,
  "anɡ7": 42,
  "anɡɜ": 43,
  "au1": 44,
  "au2": 45,
  "au4": 46,
  "au5": 47,
  "au6": 48,
  "au7": 49,
  "auɜ": 50,
  "aɜ": 51,
  "b": 52,
  "c": 53,
  "d": 54,
  "e": 55,
  "e1": 56,
  "e2": 57,
  "e4": 58,
  "e5": 59,
  "e6": 60,
  "ei1": 61,
  "ei2": 62,
  "ei4": 63,
  "ei5": 64,
  "ei6": 65,
  "ei7": 66,
  "eiɜ": 67,
  "enɡ1": 68,
  "enɡ2": 69,
  "enɡ4": 70,
  "enɡ5": 71,
  "enɡ6": 72,
  "enɡ7": 73,
  "enɡɜ": 74,
  "eo1": 75,
  "eo2": 76,
  "eo4": 77,
  "eo5": 78,
  "eo6": 79,
  "eoi1": 80,
  "eoi2": 81,
  "eoi4": 82,
  "eoi5": 83,
  "eoi6": 84,
  "eoiɜ": 85,
  "eoɜ": 86,
  "eɜ": 87,
  "eɪ": 88,
  "f": 89,
  "h": 90,
  "i1": 91,
  "i2": 92,
  "i4": 93,
  "i5": 94,
  "i6": 95,
  "i7": 96,
  "inɡ1": 97,
  "inɡ2": 98,
  "inɡ4": 99,
  "inɡ5": 100,
  "inɡ6": 101,
  "inɡ7": 102,
  "inɡɜ": 103,
  "iu1": 104,
  "iu2": 105,
  "iu4": 106,
  "iu5": 107,
  "iu6": 108,
  "iu7": 109,
  "iuɜ": 110,
  "iɜ": 111,
  "iː": 112,
  "j": 113,
  "k": 114,
  "l": 115,
  "m": 116,
  "n": 117,
  "nɡ2": 118,
  "nɡ4": 119,
  "nɡ5": 120,
  "nɡ6": 121,
  "o1": 122,
  "o2": 123,
  "o4": 124,
  "o5": 125,
  "o6": 126,
  "o7": 127,
  "oe1": 128,
  "oe6": 129,
  "oenɡ1": 130,
  "oenɡ2": 131,
  "oenɡ4": 132,
  "oenɡ5": 133,
  "oenɡ6": 134,
  "oenɡ7": 135,
  "oenɡɜ": 136,
  "oeɜ": 137,
  "oi1": 138,
  "oi2": 139,
  "oi4": 140,
  "oi5": 141,
  "oi6": 142,
  "oi7": 143,
  "oiɜ": 144,
  "onɡ1": 145,
  "onɡ2": 146,
  "onɡ4": 147,
  "onɡ5": 148,
  "onɡ6": 149,
  "onɡɜ": 150,
  "ou1": 151,
  "ou2": 152,
  "ou4": 153,
  "ou5": 154,
  "ou6": 155,
  "ou7": 156,
  "ouɜ": 157,
  "oɜ": 158,
  "p": 159,
  "s": 160,
  "t": 161,
  "u1": 162,
  "u2": 163,
  "u4": 164,
  "u5": 165,
  "u6": 166,
  "ui1": 167,
  "ui2": 168,
  "ui4": 169,
  "ui5": 170,
  "ui6": 171,
  "uiɜ": 172,
  "unɡ1": 173,
  "unɡ2": 174,
  "unɡ4": 175,
  "unɡ5": 176,
  "unɡ6": 177,
  "unɡ7": 178,
  "unɡɜ": 179,
  "uɜ": 180,
  "v": 181,
  "w": 182,
  "yu1": 183,
  "yu2": 184,
  "yu4": 185,
  "yu5": 186,
  "yu6": 187,
  "yuɜ": 188,
  "z": 189,
  "ŋ": 190,
  "ŋ2": 191,
  "ŋ4": 192,
  "ŋ5": 193,
  "ŋ6": 194,
  "ɒ": 195,
  "ə": 196,
  "əʊ": 197,
  "ɛ": 198,
  "ɡ": 199,
  "[UNK]": 200,
  "[PAD]": 201
}